# WallpaintFinish Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallPaint..::..WallpaintFinish Property
WallPaint Class See Also
---
The property labeled "Finish" from the "WallPaint" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WallpaintFinish { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallpaintFinish As String
	Get
```

Visual C++
---
```text
public:
static property String^ WallpaintFinish {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WallpaintFinishType".
# See Also
WallPaint Class
Autodesk.Revit.DB.Visual Namespace